<?php if (!defined("ADMIN_SIMPLE_CMS")) die("Access denied"); 
$arr = array(1 => 'Компоненты', 2 => 'Установленные компоненты', 3 => 'Модули', 4 => 'Установленные модули',5=>'Виджеты',7=>'Установка каталога',8=>'Создать компонент',9=>'классы',10=>'Шаблоны',11=>'Редактирование шаблона');

$complex_menu=array(1=>array(1 => 'Компоненты', 2 => 'Установленные компоненты',8=>'Создать компонент',7=>'Установка каталога'),
    2=>array(1 => 'Компоненты', 2 => 'Установленные компоненты',8=>'Создать компонент',7=>'Установка каталога'),
    3=>array(3 => 'Модули', 4 => 'Установленные модули',7=>'Установка каталога'),
    4=>array(3 => 'Модули', 4 => 'Установленные модули',7=>'Установка каталога'),
    5=>array(5=>'Виджеты'),
    7=>array(7=>'Установка каталога'),
    8=>array(1 => 'Компоненты', 2 => 'Установленные компоненты',8=>'Создать компонент'),
    9=>array(9=>'классы'),
    10=>array(10=>'Шаблоны',11=>'Редактирование шаблона'));

$action = 1;
if (isset($_GET['action'])) {
	$action = (int) $_GET['action'];
	$action=(array_key_exists($action, $arr))?$action:1;
}

//render list of actions
$arr=$complex_menu[intval($_GET['action'])];
renderActions($action,$arr,'installator');
//dump_panel($action,$arr);
include("admin.action$action.php");
?>